In [1]:
import pandas as pd
import numpy as np

In [2]:
# Some Python lists

names = ['Varun', 'Anup', 'Pihu', 'Olive', 'Mrig', 'Tilda']
ages = [20, 30, 3, 23, 35, 45]
married = [False, False, True, False, True, True]

In [3]:
# Pandas DataFrame

df = pd.DataFrame({'name': names, 'age': ages, 'married': married})

In [4]:
df

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

In [5]:
df = pd.DataFrame({'name': names, 'age': ages})

In [6]:
df

    name  age
0  Varun   20
1   Anup   30
2   Pihu    3
3  Olive   23
4   Mrig   35
5  Tilda   45

In [8]:
pd.DataFrame({'name': names, 'age': ages, 'married': married})

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

In [9]:
len(names)

6

In [10]:
new_names = names + ['Linda']

In [11]:
len(new_names)

7

In [12]:
new_names

['Varun', 'Anup', 'Pihu', 'Olive', 'Mrig', 'Tilda', 'Linda']

In [13]:
pd.DataFrame({'name': new_names, 'age': ages, 'married': married})

ValueError: All arrays must be of the same length

In [ ]:
# Approach 1 - Dictionary of Tuples

In [14]:
tuple_names = tuple(names)
tuple_ages = tuple(ages)
tuple_married = tuple(married)

In [15]:
tuple_names

('Varun', 'Anup', 'Pihu', 'Olive', 'Mrig', 'Tilda')

In [16]:
tuple_ages

(20, 30, 3, 23, 35, 45)

In [17]:
tuple_married

(False, False, True, False, True, True)

In [18]:
pd.DataFrame({'name': tuple_names,
               'age': tuple_ages,
                 'married': tuple_married })

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

In [ ]:
# Approach 2 - Dict of Series

In [19]:
series_names = pd.Series(names)

In [20]:
series_ages = pd.Series(ages)

In [21]:
series_married = pd.Series(married)

In [22]:
pd.DataFrame({'name': series_names,
               'age': series_ages,
                 'married': series_married })

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

In [ ]:
# Approach 3 - Dict of Dicts

In [ ]:
# the enumerate function

In [23]:
enumerate(names)

In [24]:
list(enumerate(names))

[(0, 'Varun'),
 (1, 'Anup'),
 (2, 'Pihu'),
 (3, 'Olive'),
 (4, 'Mrig'),
 (5, 'Tilda')]

In [25]:
dict_names = {k:v for k, v in enumerate(names)}

In [26]:
dict_names

{0: 'Varun', 1: 'Anup', 2: 'Pihu', 3: 'Olive', 4: 'Mrig', 5: 'Tilda'}

In [27]:
dict_ages = {k:v for k, v in enumerate(ages)}

In [28]:
dict_ages

{0: 20, 1: 30, 2: 3, 3: 23, 4: 35, 5: 45}

In [29]:
dict_married = {k:v for k, v in enumerate(married)}

In [30]:
dict_married

{0: False, 1: False, 2: True, 3: False, 4: True, 5: True}

In [31]:
def convert_list_to_dict(l):
    return {k:v for k, v in enumerate(l)}

In [32]:
dict_names = convert_list_to_dict(names)

In [33]:
dict_names

{0: 'Varun', 1: 'Anup', 2: 'Pihu', 3: 'Olive', 4: 'Mrig', 5: 'Tilda'}

In [34]:
dict_ages = convert_list_to_dict(ages)

In [35]:
dict_ages

{0: 20, 1: 30, 2: 3, 3: 23, 4: 35, 5: 45}

In [36]:
dict_married = convert_list_to_dict(married)

In [37]:
dict_married

{0: False, 1: False, 2: True, 3: False, 4: True, 5: True}

In [38]:
pd.DataFrame({'name': dict_names,
               'age': dict_ages,
                 'married': dict_married })

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True